In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('C:\\Users\\sapni\\OneDrive\\Desktop\\ML\\titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [4]:
target = df.Survived
inputs = df.drop('Survived',axis='columns')

In [6]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [7]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [8]:
inputs.drop('Sex',axis = 'columns' , inplace = True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [9]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [10]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [11]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(10)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1
6       1  54.000000  51.8625       0     1
7       3   2.000000  21.0750       0     1
8       3  27.000000  11.1333       1     0
9       2  14.000000  30.0708       1     0

In [13]:
from sklearn.model_selection import train_test_split
X_train , X_test , y_train , y_test = train_test_split(inputs,target,test_size=0.2)

In [14]:
len(X_train)

712

In [15]:
len(X_test)

179

In [17]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [18]:
model.fit(X_train , y_train)

GaussianNB()

In [19]:
model.score(X_test , y_test)

0.7932960893854749

In [20]:
X_test[:10]

     Pclass        Age      Fare  female  male
347       3  29.699118   16.1000       1     0
460       1  48.000000   26.5500       0     1
885       3  39.000000   29.1250       1     0
46        3  29.699118   15.5000       0     1
204       3  18.000000    8.0500       0     1
258       1  35.000000  512.3292       1     0
143       3  19.000000    6.7500       0     1
439       2  31.000000   10.5000       0     1
115       3  21.000000    7.9250       0     1
131       3  20.000000    7.0500       0     1

In [21]:
y_test[:10]

347    1
460    1
885    0
46     0
204    1
258    1
143    0
439    0
115    0
131    0
Name: Survived, dtype: int64

In [22]:
model.predict(X_test[:10])

array([1, 0, 1, 0, 0, 1, 0, 0, 0, 0], dtype=int64)

In [24]:
model.predict_proba(X_test[:10])

array([[6.58443028e-02, 9.34155697e-01],
       [9.16522895e-01, 8.34771047e-02],
       [6.67282958e-02, 9.33271704e-01],
       [9.87769837e-01, 1.22301626e-02],
       [9.84721528e-01, 1.52784725e-02],
       [1.46893912e-44, 1.00000000e+00],
       [9.84939062e-01, 1.50609376e-02],
       [9.73653247e-01, 2.63467533e-02],
       [9.85634594e-01, 1.43654058e-02],
       [9.85274235e-01, 1.47257652e-02]])

In [25]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train,y_train,cv=5)

array([0.81118881, 0.76223776, 0.8028169 , 0.76760563, 0.75352113])